Обработки/Reports/_ОтчетОВозвращенныхРасторгнутыхДоговорах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОВозвращенныхРасторгнутыхДоговорах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОВозвращенныхРасторгнутыхДоговорах/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о возвращенных / расторгнутых договорах",
		"0.7",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,АгентскийДоговор");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	#Область ПолучениеДанных
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("АгентскийДоговор", АгентскийДоговор);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.Ссылка КАК СДУ,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	СчетаДоверительногоУправления.ДатаРасторжения КАК ДатаРасторжения
		|ПОМЕСТИТЬ _СДУ
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|ГДЕ
		|	СчетаДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
		|	И СчетаДоверительногоУправления.ДатаРасторжения <> ДАТАВРЕМЯ(1, 1, 1)
		|	И СчетаДоверительногоУправления.ДатаРасторжения МЕЖДУ &НачалоПериода И &КонецПериода
		|	И СчетаДоверительногоУправления.Организация = &Организация
		|	И НЕ СчетаДоверительногоУправления.ПометкаУдаления
		|	И СчетаДоверительногоУправления.ДатаЗаключения <> ДАТАВРЕМЯ(1, 1, 1)
		|	И СчетаДоверительногоУправления.АгентскийДоговор = &АгентскийДоговор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.СчетДоверительногоУправления КАК СДУ,
		|	СтратегииИндивидуальногоИнвестированияСрезПоследних.Стратегия КАК Стратегия
		|ПОМЕСТИТЬ _СтратегииКлиентов
		|ИЗ
		|	РегистрСведений.СтратегииИндивидуальногоИнвестирования.СрезПоследних(
		|			&КонецПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СДУ.СДУ КАК СДУ
		|					ИЗ
		|						_СДУ КАК _СДУ)) КАК СтратегииИндивидуальногоИнвестированияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СДУ.СДУ КАК Клиент,
		|	_СтратегииКлиентов.Стратегия КАК Стратегия,
		|	_СДУ.НомерДоговора КАК НомерДоговора,
		|	_СДУ.ДатаДоговора КАК ДатаДоговора,
		|	СУММА(ВводыВыводыАктивовВВалютеУчетаОбороты.РыночнаяСтоимостьОборот) КАК Стоимость,
		|	НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчетаОбороты.Регистратор.Дата, ДЕНЬ) КАК ДатаВозврата
		|ИЗ
		|	РегистрНакопления.ВводыВыводыАктивовВВалютеУчета.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_СДУ.СДУ КАК СДУ
		|					ИЗ
		|						_СДУ КАК _СДУ)
		|				И НаправлениеДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|				И ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.ДенежныеСредства)) КАК ВводыВыводыАктивовВВалютеУчетаОбороты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СДУ КАК _СДУ
		|		ПО ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления = _СДУ.СДУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _СтратегииКлиентов КАК _СтратегииКлиентов
		|		ПО ВводыВыводыАктивовВВалютеУчетаОбороты.СчетДоверительногоУправления = _СтратегииКлиентов.СДУ
		|
		|СГРУППИРОВАТЬ ПО
		|	_СДУ.СДУ,
		|	_СтратегииКлиентов.Стратегия,
		|	_СДУ.НомерДоговора,
		|	_СДУ.ДатаДоговора,
		|	НАЧАЛОПЕРИОДА(ВводыВыводыАктивовВВалютеУчетаОбороты.Регистратор.Дата, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	_СДУ.СДУ.Наименование";
	#КонецОбласти
	
	#Область ВыводДанных
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка	= Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал	= Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.НачалоПериода	= Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.КонецПериода		= Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НомерДоговора	= АгентскийДоговор.НомерДоговора;
	ОбластьШапка.Параметры.ДатаДоговора		= Формат(АгентскийДоговор.ДатаЗаключения, "ДФ=dd.MM.yyyy");
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерСтроки		= 1;
	ИтогоСтоимость	= 0;
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока.Параметры.НомерСтроки		= НомерСтроки;
		ОбластьСтрока.Параметры.Клиент			= Выборка.Клиент;
		ОбластьСтрока.Параметры.Стратегия		= Выборка.Стратегия;
		ОбластьСтрока.Параметры.НомерДоговора	= Выборка.НомерДоговора;
		ОбластьСтрока.Параметры.ДатаДоговора	= Выборка.ДатаДоговора;
		ОбластьСтрока.Параметры.Стоимость		= Выборка.Стоимость;
		ОбластьСтрока.Параметры.ДатаВозврата	= Выборка.ДатаВозврата;
		
		ДокументРезультат.Вывести(ОбластьСтрока);
		
		ИтогоСтоимость		= ИтогоСтоимость + Выборка.Стоимость;
		НомерСтроки			= НомерСтроки + 1;
		
	КонецЦикла;
	
	ОбластьПодвал.Параметры.ИтогоСтоимость = ИтогоСтоимость;
	
	ДокументРезультат.Вывести(ОбластьПодвал);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя(), , ОриентацияСтраницы.Портрет);	
	#КонецОбласти
	
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
